/*ЗАДАЧА – Первази
Силвия наскоро си купи чисто нов апартамент. Тъй като строителите
тъкмо били свършили с грубия строеж, апартаментът все още си нямал нищо и
Силвия трябвала да си го обзаведе и завърши изцяло. След като приключила
със стените и пода, тя решила да постави первазите между тях, така че
измерила всички дължини на стените и дала поръчка в местния магазин за
строителни материали да бъдат изработени. Когато отишла да си ги вземе
обаче с ужас установила, че поради проблеми с машината за рязане дървените
первази не били готови, а само им били отбелязани местата на срязване върху
един голям перваз с обща дължина сумата на дължините на всички парчета,
които трябвали на Силвия. Тя се ядосала, защото не само че первазите не
били нарязани, ами и били отбелязани върху перваза, така че трябвало
задължително да ги реже в този ред. Накрая Силвия се сетила, че може да
поиска от Краси неговата машина за рязане на дърво и се успокоила, тръгвайки
си от магазина, замъквайки дългия перваз до вкъщи. Но тук дошла тежката част
– трябвало да нареже перваза по разграфените места. Силвия взела назаем
машината и се замислила „Трябва да срежа перваза по всички отбелязки, а за
да срежа по някоя, трябва да вдигна парчето, на която се намира, и да го сложа
на машината. Вдигането ще ми струва усилие, пропорционално на дължината
на перваза, който режа. Как да минимизирам усилието?!“ . И наистина,
вдигането на толкова много первази си е тежка работа, така че Силвия се
обръща към вас за помощ.
Вход
На първия ред на стандартния вход се намира числото N – броя на
первазите в апартамента на Силвия. На следващия ред, разделени с по един
интервал, стоят числата a1, a2, … , aN – дължините на первазите в апартамента,
в реда, в който са отбелязани върху общия перваз.
Изход
На единствен ред на стандартния изход изведете числото S –
минималното усилие, с което Силвия може да нареже перваза. Обърнете
внимание, че усилието, нужно да срежеш на 2 парче перваз, е равно на
дължината на целия перваз, и след срязването 2-те нови парчета падат на
земята, така че ако трябва да се режат допълнително, трябва отново да се
вдигнат върху машината.*/

#include <iostream>
#include <climits>
using namespace std;

int n, num[1000], w[1000], dp[1000][1000];

void init() {
    cin >> n;
    for(int i=0; i<n; i++) {
        cin >> num[i];
    }
    w[0] = 0;
    for(int i=1; i<=n; i++) {

        w[i] = w[i-1] + num[i-1];
    }

    for(int i=0; i<=n; i++) {
        for(int j=0; j<=n; j++) {
            dp[i][j] = INT_MAX;
        }
    }
}

int calc(int i, int j) {
   // cout << i << " " << j << endl;
    if(dp[i][j] != INT_MAX) {
        return dp[i][j];
    }
    if(i == j) {
        return 0;
    }

    for(int k=i;k<j;k++) {
     //   cout << "up: " << w[j+1] << " low: " << w[i] << endl;
         dp[i][j] = min(dp[i][j],w[j+1] - w[i] + calc(i,k) + calc(k+1,j));

    }

    return dp[i][j];
}

int main() {

    init();

    cout << calc(0, n-1) << endl;
}
