/*
ЗАДАЧА - Beads
Криси е луда на тема мъниста и много обича да изработва сама всякакви
дрънкулки и бижута. Всяка неделя тя търчи до най-големия магазин за мъниста
в града и си купува по един тон с всевъзможни цветове. Сега, затрупана с
малките топченца, е седнала да ги нанизва едно след друго.
Пред себе си Криси има мъниста от K различни цвята. Тя иска да направи
наниз с N мъниста, като задължително не трябва да има две сини мъниста едно
до друго. Може да приемете, че разполага с безкраен набор от мъниста от
всеки цвят и един от тях е син. И освен това, последното не е съседно на
първото. По колко различни начина тя може да подреди мънистата, така че да е
спазено условието. Мънистата от един и същи цвят се приемат за еднакви.
*/

#include <iostream>
#include <queue>
using namespace std;

int main() {

    ios_base::sync_with_stdio(false);
    cin.tie(NULL);


    long long n;
    cin >> n;
    long long k;
    cin >> k;

    long long prev = 1;
    long long curr = k;
    long long ans = k;

    for(int i=2; i<=n; i++) {

        ans = ((prev + curr)*(k-1))%1000000007;
        prev = curr;
        curr = ans;

    }

    cout << ans;
    return 0;
}
